package ua.jeka_roxy.Easy;

/**
 * Created by wojda on 23.02.2016.
 */
public class Task_004 {
}

/*
Каково наименьшее число, которое можно поделить на любое число от 1 до 20 без остатка?

Найди сумму всех чисел ниже 1000, которые делятся на 3 или 5 без остатка.

Найди еще один триплет Пифагора, для которого выполняется условие a+b+c=1000. В ответ запишите a*b*c.

Найди сумму всех простых чисел ниже двух миллионов.

Найди сумму цифр в числе 100!

Посчитай 1! + 2! + 3! + ... + n!

Какой первый член в последовательности Фибоначчи, который будет содержать 1000 цифр?

Найди сумму всех чисел, кратных 3 или 5 ниже 1000.
 */
